experiments/results/logs/ramp-hpa-003/wrk2.txt
Running 5m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 7016.802ms, rate sampling interval: 16793ms
  Thread calibration: mean lat.: 7448.248ms, rate sampling interval: 16924ms
  Thread calibration: mean lat.: 7736.279ms, rate sampling interval: 17334ms
  Thread calibration: mean lat.: 7577.436ms, rate sampling interval: 17121ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.24m     1.18m    4.28m    57.50%
    Req/Sec     3.26      0.47     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.24m 
 75.000%    3.26m 
 90.000%    3.86m 
 99.000%    4.21m 
 99.900%    4.26m 
 99.990%    4.28m 
 99.999%    4.28m 
100.000%    4.28m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9355.263     0.000000            1         1.00
   35127.295     0.100000          440         1.11
   60358.655     0.200000          877         1.25
   84672.511     0.300000         1316         1.43
  109838.335     0.400000         1755         1.67
  134217.727     0.500000         2192         2.00
  147718.143     0.550000         2414         2.22
  159776.767     0.600000         2633         2.50
  172490.751     0.650000         2852         2.86
  184680.447     0.700000         3073         3.33
  195821.567     0.750000         3289         4.00
  201850.879     0.775000         3398         4.44
  208666.623     0.800000         3512         5.00
  215089.151     0.825000         3622         5.71
  220332.031     0.850000         3728         6.67
  226492.415     0.875000         3836         8.00
  228851.711     0.887500         3894         8.89
  231735.295     0.900000         3946        10.00
  234225.663     0.912500         4006        11.43
  237240.319     0.925000         4057        13.33
  239599.615     0.937500         4113        16.00
  240779.263     0.943750         4139        17.78
  242089.983     0.950000         4165        20.00
  244449.279     0.956250         4194        22.86
  245497.855     0.962500         4223        26.67
  247463.935     0.968750         4248        32.00
  248381.439     0.971875         4261        35.56
  249298.943     0.975000         4275        40.00
  250216.447     0.978125         4291        45.71
  250740.735     0.981250         4302        53.33
  251133.951     0.984375         4318        64.00
  251396.095     0.985938         4328        71.11
  251527.167     0.987500         4331        80.00
  252051.455     0.989062         4338        91.43
  252444.671     0.990625         4346       106.67
  252575.743     0.992188         4350       128.00
  253100.031     0.992969         4355       142.22
  253231.103     0.993750         4357       160.00
  253362.175     0.994531         4361       182.86
  253493.247     0.995313         4366       213.33
  253624.319     0.996094         4368       256.00
  253755.391     0.996484         4369       284.44
  254279.679     0.996875         4372       320.00
  254410.751     0.997266         4373       365.71
  254672.895     0.997656         4375       426.67
  255197.183     0.998047         4376       512.00
  255328.255     0.998242         4377       568.89
  255459.327     0.998437         4378       640.00
  255590.399     0.998633         4380       731.43
  255590.399     0.998828         4380       853.33
  255590.399     0.999023         4380      1024.00
  255721.471     0.999121         4381      1137.78
  255721.471     0.999219         4381      1280.00
  255852.543     0.999316         4382      1462.86
  255852.543     0.999414         4382      1706.67
  255852.543     0.999512         4382      2048.00
  255983.615     0.999561         4383      2275.56
  255983.615     0.999609         4383      2560.00
  255983.615     0.999658         4383      2925.71
  255983.615     0.999707         4383      3413.33
  255983.615     0.999756         4383      4096.00
  256901.119     0.999780         4384      4551.11
  256901.119     1.000000         4384          inf
#[Mean    =   134275.449, StdDeviation   =    70870.048]
#[Max     =   256770.048, Total count    =         4384]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4488 requests in 5.00m, 46.02MB read
  Socket errors: connect 0, read 0, write 0, timeout 10459
Requests/sec:     14.95
Transfer/sec:    157.00KB